CSI API ETABS v1
cAnalysisResultsSetup.SetOptionModeShape Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetOptionModeShape(
	int ModeShapeStart,
	int ModeShapeEnd,
	bool ModeShapesAll = false
)
Function SetOptionModeShape (
	ModeShapeStart As Integer,
	ModeShapeEnd As Integer,
	Optional ModeShapesAll As Boolean = false
) As Integer
Dim instance As cAnalysisResultsSetup
Dim ModeShapeStart As Integer
Dim ModeShapeEnd As Integer
Dim ModeShapesAll As Boolean
Dim returnValue As Integer
returnValue = instance.SetOptionModeShape(ModeShapeStart,
	ModeShapeEnd, ModeShapesAll)
int SetOptionModeShape(
	int ModeShapeStart,
	int ModeShapeEnd,
	bool ModeShapesAll = false
)
abstract SetOptionModeShape :
        ModeShapeStart : int *
        ModeShapeEnd : int *
        ?ModeShapesAll : bool
(* Defaults:
        let _ModeShapesAll = defaultArg ModeShapesAll false
*)
-> int
Parameters
ModeShapeStart
Type: System.Int32
ModeShapeEnd
Type: System.Int32
ModeShapesAll (Optional)
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cAnalysisResultsSetup Interface
ETABSv1 Namespace